# Before your start:
- Read the README.md file
- Comment as much as you can and use the resources in the README.md file
- Happy learning!

# Challenge 1 - Accessing our database
Create a connection to access the sakila database with the ip, user and password provided in class. Take a look at the data. Do some joins in order to have more elaborated tables in a dataframe (you can try first the query in the DBMS and then use it in your notebook).

In [1]:
# Libraries
import pandas as pd
from sqlalchemy import create_engine
import pymysql

In [2]:
##CONNECTION
driver = 'mysql+pymysql'
ip = '34.65.10.136'
username = 'data-students'
password = 'iR0nH@cK-D4T4B4S3'
db = 'sakila'
connection_string  = f'{driver}://{username}:{password}@{ip}/{db}'

In [3]:
##DEFINE ADDRESS
engine = create_engine(connection_string)
query = 'SELECT * FROM actor'

In [4]:
##database request
sakila_actor = pd.read_sql(query,engine)
sakila_actor

     actor_id first_name     last_name         last_update
0           1   PENELOPE       GUINESS 2006-02-15 04:34:33
1           2       NICK      WAHLBERG 2006-02-15 04:34:33
2           3         ED         CHASE 2006-02-15 04:34:33
3           4   JENNIFER         DAVIS 2006-02-15 04:34:33
4           5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33
5           6      BETTE     NICHOLSON 2006-02-15 04:34:33
6           7      GRACE        MOSTEL 2006-02-15 04:34:33
7           8    MATTHEW     JOHANSSON 2006-02-15 04:34:33
8           9        JOE         SWANK 2006-02-15 04:34:33
9          10  CHRISTIAN         GABLE 2006-02-15 04:34:33
10         11       ZERO          CAGE 2006-02-15 04:34:33
11         12       KARL         BERRY 2006-02-15 04:34:33
12         13        UMA          WOOD 2006-02-15 04:34:33
13         14     VIVIEN        BERGEN 2006-02-15 04:34:33
14         15       CUBA       OLIVIER 2006-02-15 04:34:33
15         16       FRED       COSTNER 2006-02-15 04:34:33
16         17      HELEN        VOIGHT 2006-02-15 04:34:33
17         18        DAN          TORN 2006-02-15 04:34:33
18         19        BOB       FAWCETT 2006-02-15 04:34:33
19         20    LUCILLE         TRACY 2006-02-15 04:34:33
20         21    KIRSTEN       PALTROW 2006-02-15 04:34:33
21         22      ELVIS          MARX 2006-02-15 04:34:33
22         23     SANDRA        KILMER 2006-02-15 04:34:33
23         24    CAMERON        STREEP 2006-02-15 04:34:33
24         25      KEVIN         BLOOM 2006-02-15 04:34:33
25         26        RIP      CRAWFORD 2006-02-15 04:34:33
26         27      JULIA       MCQUEEN 2006-02-15 04:34:33
27         28      WOODY       HOFFMAN 2006-02-15 04:34:33
28         29       ALEC         WAYNE 2006-02-15 04:34:33
29         30     SANDRA          PECK 2006-02-15 04:34:33
..        ...        ...           ...                 ...
170       171    OLYMPIA      PFEIFFER 2006-02-15 04:34:33
171       172    GROUCHO      WILLIAMS 2006-02-15 04:34:33
172       173       ALAN      DREYFUSS 2006-02-15 04:34:33
173       174    MICHAEL        BENING 2006-02-15 04:34:33
174       175    WILLIAM       HACKMAN 2006-02-15 04:34:33
175       176        JON         CHASE 2006-02-15 04:34:33
176       177       GENE      MCKELLEN 2006-02-15 04:34:33
177       178       LISA        MONROE 2006-02-15 04:34:33
178       179         ED       GUINESS 2006-02-15 04:34:33
179       180       JEFF   SILVERSTONE 2006-02-15 04:34:33
180       181    MATTHEW        CARREY 2006-02-15 04:34:33
181       182     DEBBIE        AKROYD 2006-02-15 04:34:33
182       183    RUSSELL         CLOSE 2006-02-15 04:34:33
183       184   HUMPHREY       GARLAND 2006-02-15 04:34:33
184       185    MICHAEL        BOLGER 2006-02-15 04:34:33
185       186      JULIA     ZELLWEGER 2006-02-15 04:34:33
186       187      RENEE          BALL 2006-02-15 04:34:33
187       188       ROCK       DUKAKIS 2006-02-15 04:34:33
188       189       CUBA         BIRCH 2006-02-15 04:34:33
189       190     AUDREY        BAILEY 2006-02-15 04:34:33
190       191    GREGORY       GOODING 2006-02-15 04:34:33
191       192       JOHN        SUVARI 2006-02-15 04:34:33
192       193       BURT        TEMPLE 2006-02-15 04:34:33
193       194      MERYL         ALLEN 2006-02-15 04:34:33
194       195      JAYNE   SILVERSTONE 2006-02-15 04:34:33
195       196       BELA        WALKEN 2006-02-15 04:34:33
196       197      REESE          WEST 2006-02-15 04:34:33
197       198       MARY        KEITEL 2006-02-15 04:34:33
198       199      JULIA       FAWCETT 2006-02-15 04:34:33
199       200      THORA        TEMPLE 2006-02-15 04:34:33

[200 rows x 4 columns]

# Challenge 2 - Working with JSON files

Import the pandas library.

In [15]:
# your code here



# Libraries
import pandas as pd
from sqlalchemy import create_engine
import pymysql

In the next cell, load the data in `nasa.json` in the `data` folder and load it into a pandas dataframe. Name the dataframe `nasa`.

In [26]:
# your code here

nasa = pd.read_json('/Users/rubenmartinezlorente/data-bcn-prework/DATA_COURSE/W2/W2D3/lab-import-export/data/nasa.json')

#b = pd.read_json('W2D3/lab-import-export/data/nasa.json')

Now that we have loaded the data, let's examine it using the `head()` function.

In [28]:
# your code here

nasa.head()

,:@computed_region_cbhk_fwbd,:@computed_region_nnqa_25f4,fall,geolocation,id,mass,name,nametype,recclass,reclat,reclong,year
0,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [6.08333, 50....",1,21.0,Aachen,Valid,L5,50.77500,6.08333,1880-01-01T00:00:00.000
1,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [10.23333, 56...",2,720.0,Aarhus,Valid,H6,56.18333,10.23333,1951-01-01T00:00:00.000
2,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-113, 54.216...",6,107000.0,Abee,Valid,EH4,54.21667,-113.00000,1952-01-01T00:00:00.000
3,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-99.9, 16.88...",10,1914.0,Acapulco,Valid,Acapulcoite,16.88333,-99.90000,1976-01-01T00:00:00.000
4,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-64.95, -33....",370,780.0,Achiras,Valid,L6,-33.16667,-64.95000,1902-01-01T00:00:00.000

#### The `value_counts()` function is commonly used in pandas to find the frequency of every value in a column.

In the cell below, use the `value_counts()` function to determine the frequency of all types of asteroid landings by applying the function to the `fall` column.

In [44]:
# your code here

nasa_fall = nasa['fall'].value_counts()
nasa_fall

Fell     996
Found      4
Name: fall, dtype: int64

Finally, let's save the dataframe as a json file again. Save the dataframe using the `orient=records` argument and name the file `nasa-output.json`. Remember to save the file inside the `data` folder.

In [45]:
# your code here
nasa_fall.to_json(r'/Users/rubenmartinezlorente/data-bcn-prework/DATA_COURSE/W2/W2D3/lab-import-export/data/nasa-output.json', orient = 'records')

# Challenge 2 - Working with CSV and Other Separated Files

CSV files are more commonly used as dataframes. In the cell below, load the file from the URL provided using the `read_csv()` function in pandas. Starting version 0.19 of pandas, you can load a CSV file into a dataframe directly from a URL without having to load the file first and then transform it. The dataset we will be using contains information about NASA shuttles.

In the cell below, we define the column names and the URL of the data. Following this cell, read the tst file to a variable called `shuttle`. Since the file does not contain the column names, you must add them yourself using the column names declared in `cols` using the `names` argument. Additionally, a tst file is space separated, make sure you pass ` sep=' '` to the function.

In [55]:
cols = ['time', 'rad_flow', 'fpv_close', 'fpv_open', 'high', 'bypass', 'bpv_close', 'bpv_open', 'class']
tst_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/statlog/shuttle/shuttle.tst'

In [61]:
# your code here

shuttle = pd.read_csv(tst_url, sep = ' ', names = cols)

Let's verify that this worked by looking at the `head()` function.

In [62]:
# your code here
shuttle.head()

,time,rad_flow,fpv_close,fpv_open,high,bypass,bpv_close,bpv_open,class
55,0,81,0,-6,11,25,88,64,4
56,0,96,0,52,-4,40,44,4,4
50,-1,89,-7,50,0,39,40,2,1
53,9,79,0,42,-2,25,37,12,4
55,2,82,0,54,-6,26,28,2,1

To make life easier for us, let's turn this dataframe into a comma separated file by saving it using the `to_csv()` function. Save `shuttle` into the file `shuttle.csv` and ensure the file is comma separated, that we are not saving the index column and that the file is saved inside the `data` folder.

In [ ]:
# your code here

# Challenge 3 - Working with Excel Files

We can also use pandas to convert excel spreadsheets to dataframes. Let's use the `read_excel()` function. In this case, `astronauts.xls` is in the `data` folder. Read this file into a variable called `astronaut`. 

Note: Make sure to install the `xlrd` library if it is not yet installed.

In [ ]:
# your code here

Use the `head()` function to inspect the dataframe.

In [ ]:
# your code here

Use the `value_counts()` function to find the most popular undergraduate major among all astronauts.

In [ ]:
# your code here

Due to all the commas present in the cells of this file, let's save it as a tab separated csv file. In the cell below, save `astronaut` as a **tab separated file** using the `to_csv` function. Call the file `astronaut.csv`. Remember to remove the index column and save the file in the `data` folder.

In [ ]:
# your code here

# Bonus Challenge - Fertility Dataset

Visit the following [URL](https://archive.ics.uci.edu/ml/datasets/Fertility) and retrieve the dataset as well as the column headers. Determine the correct separator and read the file into a variable called `fertility`. Examine the dataframe using the `head()` function. 

Look in Google for a way to retrieve this data!

In [ ]:
# your code here